IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MPU_R5SS1_CORE1_AHB_MPU_R5SS1_CORE1_AHB.xml
	<register id="MPU_R5SS1_CORE1_AHB_FAULT_ADDRESS" acronym="MPU_R5SS1_CORE1_AHB_FAULT_ADDRESS" offset="0x300" width="32" description="">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault address." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS1_CORE1_AHB_FAULT_STATUS" acronym="MPU_R5SS1_CORE1_AHB_FAULT_STATUS" offset="0x304" width="32" description="">
		<bitfield id="ID" width="8" begin="31" end="24" resetval="0x0" description="Transfer ID" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="MSTID" width="8" begin="23" end="16" resetval="0x0" description="Master ID." range="23 - 16" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="15" end="13" resetval="0x0" description="Always read as 0." range="15 - 13" rwaccess="RO"/> 
		<bitfield id="PRIVID" width="4" begin="12" end="9" resetval="0x0" description="Privilege ID." range="12 - 9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure access." range="7" rwaccess="RO"/> 
		<bitfield id="RESERVED2" width="1" begin="6" end="6" resetval="0x0" description="Always read as 0." range="6" rwaccess="RO"/> 
		<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault type.100000 = supervisor read fault010000 = supervisor write fault001000 = supervisor execute fault000100 = user read fault000010 = user write fault000001 = user execute fault111111 = relaxed cache linefill fault010010 = relaxed cache writeback fault000000 = no fault" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS1_CORE1_AHB_FAULT_CLEAR" acronym="MPU_R5SS1_CORE1_AHB_FAULT_CLEAR" offset="0x308" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Always read as 0." range="31 - 1" rwaccess="RO"/> 
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a0 has no effect." range="0" rwaccess="WO"/>
	</register>
</module>